@extends("navbar")
@section("aboutautism")
<!doctype html>
<html class="no-js" lang="zxx">

<head>
    <meta charset="utf-8">
    <meta http-equiv="x-ua-compatible" content="ie=edge">
    <title>عن التوحد </title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <!-- <link rel="manifest" href="site.webmanifest"> -->
    <link rel="shortcut icon" type="image/x-icon" href="">
    <!-- Place favicon.ico in the root directory -->


</head>

<body>
    <!--[if lte IE 9]>
            <p class="browserupgrade">You are using an <strong>outdated</strong> browser. Please <a href="https://browsehappy.com/">upgrade your browser</a> to improve your experience and security.</p>
        <![endif]-->


    <!-- header-start -->
  
    <!-- bradcam_area_start  -->
    <div class="bradcam_area breadcam_bg_1 overlay d-flex align-items-center justify-content-center">
        <div class="container">
            <div class="row">
                <div class="col-xl-12">
                    <div class="bradcam_text text-center">
                    </div>
                </div>
            </div>
        </div>
    </div>
    <!-- bradcam_area_end  -->

    <!-- reson_area_start  -->
    <div class="reson_area section_padding">
        <div class="container">
            <div class="row justify-content-center">
                <div class="col-lg-12">
                    <div class="section_title text-right mb-55">
                       <h1 class="title1">ما هو التوحد ؟</h1> 
                        <p3>هو اضطراب في النمو العصبي خطير يضعف من قدرة الطفل علي التواصل والتفاعل مع الأخرين وصعوبة القيام والمشاركة في السلوكيات والهوايات والأنشطة المختلفة وبالتالي يؤثر علي حياته الإجتماعية . </p3><br><br><br>
                        <h1 class="title1">أعراض التوحد :</h1>
                        <p3>التوحد اضطراب يؤثر علي إدراك الطفل وطريقة اتصاله مع الأخرين مما يسبب العديد من المشاكل في المجالات الحيوية في التفاعل الإجتماعي والتواصل والسلوك،
 بعض الأطفال تظهر لديهم علامات التوحد مبكراً وقد تتطور هذه الأعراض خلال الأشهر القليلة الأولي إلي تحول الطفل إلي شخصية عدوانية ويفقد القدرة علي تحسين المهارات اللغوية، وغالباً ما يمتلك الطفل الذي يعاني من التوحد من نمط فريد من السلوك مما يؤدي إلي صعوبة التواصل الإجتماعي وفيما يلي مجموعة من الأعراض والسلوكيات التي تدل علي التوحد :-<br><br> 
                            <p4>صعوبة التواصل والتفاعل الإجتماعي :</p4><br>
 <p3>                          
•	عندما يفشل الطفل في الرد علي سؤال ما إسمك، أو يظهر بأنه لا يسمع ما قلته له .<br> 
•	يقاوم العناق ويفضل اللعب بمفرده.<br> 
•	يفتقر تعبيرات الوجه.<br> 
•	توجد لديه صعوبة في الكلام وتأخر الحديث ويفقد القدرة علي نطق الكلمات والجمل.<br> 
•	 لا يقدر علي بدء المحادثة .<br> 
•	يتحدث بلهجة غير طبيعية ونبرة صوت بيطئة .<br> 
•	 قد يقوم بتكرار بعض الكلمات والعبارات حرفياً، ولكن لا يفهم كيفية إستخدامها .<br> 
•	يبدو وأنه لا يفهم معظم الأسئلة الموجهة له  .<br> 
•	لا يستطيع التعبير عن عواطفه أو مشاعره إتجاه الأخرين .<br> 
•	لديه سلوك عدواني عند التفاعل الإجتماعي مع الأخرين.<br> 
</p3><br> 
             <p4>ظهور مجموعة من السلوكيات الخاطئة :</p4><br>
                            <p3>
•	 ضرب الرأس. <br>
•	الحركة المستمرة.<br>
•	قد يكون الطفل غير متعاون ولا يرغب في التغير .<br>
•	المشي علي الأصابع .<br>
•	قد يرغب في التمسك بلعبة معينة.<br>
•	قد يكون حساس للضوء . <br>
•	قد يكون لديه سلوك غذائي معين مثل تناول أطعمة محددة. <br>

                            </p3>
</p3><br>
                        <h1 class="title1">أسباب التوحد  :</h1>
                        <p3>
                            <p4>لا يوجد هناك سبب واحد معروف هناك أسباب كثير تؤدي إلي التوحد وإليك بعض الأسباب التي تؤدي إلي التوحد، ومنها:-</p4><br>
                           <p4> المشاكل الوراثية :</p4>
هناك العديد من الجينات المختلفة تؤدي إلي إضطراب التوحد، بالنسبة للأطفال قد يرتبط التوحد مع الإضطرابات الوراثية وعند بعض الأفراد بالتغيرات الجينية التي تجعل الأطفال أكثرعرضة للإصابة باضطراب التوحد لأن الجينات قد تؤثر علي نمو الدماغ أو خلايا التواصل في المخ ، غالباً ما تكون بعض المشاكل الجينية موروثة والبعض الأخر يحدث من تلقاء نفسه. <br>
                            <p4>العوامل البيئة : </p4>
                            يذكر العلماء بأن هناك مجموعة من العوامل البيئة تؤدي إلي التوحد مثل الإلتهابات الفيروسية، مضاعفات الحمل وملوثات الهواء.<br>
                            <p4><font color="darkgreen">عوامل تُزيد من خطر الإصابة بالتوحد :</font></p4><br>
• جنس الطفل : الأولاد أكثر عرضة لظهورالتوحد من الفتيات.<br>
• التاريخ العائلي : بعض العائلات التي لديها طفل واحد يعاني من التوحد يزيد لديهم خطر إصابة طفل آخر بالتوحد ويصبح لديه مشاكل في الإتصال الاجتماعي والتواصل مع الأخرين. <br>
• الاضطرابات الأخري : الأطفال الذين لديهم إضطرابات وحالات طبية معينة يزداد لديهم خطر الإصابة بالتوحد مثل الأطفال الذين يعانوا من المشاكل الفكرية، الاضطرابات العصبية .<br>
• الولادة المبكرة للأطفال: عند ولادة الأطفال بعد مرور 26 أسبوع من الحمل يزيد من خطر حدوث اضطربات التوحد. <br>

                        </p3>
                        <br><br>
                          <h1 class="title1">أشياء يتمنى كل طفل توحدي أن تعرفوها:</h1>
                        <br>
                        <p4>أنا أولاً وأخيراَ “طفل” أعاني من التوحد وليست هي صفتي الوحيدة </p4>
                        <p3> توحدي هو جزء بسيط من شخصيتي ولا يحددني كشخص، أنت…هل لك أفكارك ومشاعرك ومواهبك وقدراتك المختلفة؟ أم أنك تنفرد بصفة واحدة فقط؟ هل أنت بدين؟ تعاني من السمنة؟ هل تلبس نظارات؟ تعاني من قصر النظر؟ كل هذه الصفات قد ألاحظها فيك عندما أقابلك لأول مرة لكنها بالتأكيد ليست الصفات الوحيدة فيك.</p3><br><br>
                        
                        <p4>أرجوا أن تفرقوا بين (اختار أن لا أفعل) وبين لا استطيع (غير قادر على فعل ) </p4>
                        <p3>  ليس الأمر أنني لا أريد أن أطيع الأوامر، الأمر أني لا أستطيع أن أفهمك..! أقترب مني وتكلم معي بعبارات وكلمات واضحة مثلاً: ضع كتابك على الطاولة، حان وقت الغداء.. هكذا تقول لي ما تُريدني أن أفعل وما سيحدث بعد ذلك، بذلك يسهل علي أن أفعل ما تريده مني.</p3><br><br>
                        
                        <p4>لدي اضطراب في جهاز الادراك الحسّي (الحواس الخمسة) </p4>
                        <p3> ذلك يعني أن المناظر والأصوات والروائح والنكهات وملمس الأشياء المختلفة التي نختبرها كل يوم ويتعود عليها الشخص العادي قد تسبب لي الآماً شديدة، قد أبدو منطوياً أو غير اجتماعي ولكنني في الحقيقة أحاول فقط الدفاع عن نفسي وعن حواسي.</p3><br><br>
                        
                        <p4>أنا أفكر حرفياً..</p4>
                        <p3> ذلك يعني أنني أفهم وأطبق اللغة حرفياً، يكون الأمر محيراً بالنسبة لي عندما تقول (الجدران لها آذان) بينما تعني أنه من الممكن أن يسمعنا أحد، بدلاً من أن تقول لي (اضرب الحديد وهو ساخن) قل لي (قم بفعل ذلك بسرعة) الأمثال والتشبيهات والنكات غير واضحة بالنسبة لي ويصعب علي فهمها.</p3><br><br>
                        
                        <p4>ساعدني أن أتأقلم اجتماعياً </p4>
                        <p3> قد يبدو أنني لا أريد اللعب مع الأطفال ولكنني في الحقيقة لا أعرف كيف ألعب أو أبدأ الحديث مع الأخرين، إذا استطعت أن تشجع الأطفال الاخرين على اللعب معي وضمي للفريق سأكون بغاية السعادة بانضمامي اليهم ومشاركتي إياهم في اللعب، أبلي حسناً في النشاطات التي لها بداية ونهاية واضحة، لا أعرف أن أقرأ أوأفهم تعبيرات الوجه والجسد وأحاسيس الآخرين لذلك سأقدر لك إن دربتني على ردود الفعل الاجتماعية الصحيحة، مثلاً.. قد أضحك عندما يسقط أحد أصدقائي من على الزلاجة ليس لأني أرى أن الموقف مضحك ولكن لأني لا أعرف ردة الفعل المناسبة في هذا الموقف، علمني كيف أسأل: هل أنت بخير؟</p3><br>
                        <p></p><br>
                    </div>
                </div>
            </div>
        </div>
    </div>
    <!-- reson_area_end  -->

  

    <!-- link that opens popup -->

  
</body>

</html>
@endsection