<?php

namespace App\Http\Requests;

use Illuminate\Foundation\Http\FormRequest;
use Illuminate\Validation\Rule;

class resultrequest extends FormRequest
{
    /**
     * Determine if the user is authorized to make this request.
     *
     * @return bool
     */
    public function authorize()
    {
        return true;
    }

    /**
     * Get the validation rules that apply to the request.
     *
     * @return array
     */
    public function rules()
    {
        return [
            'txt1'=>'required|numeric|min:0|max:3',
            'txt2'=>'required|numeric|min:0|max:3',
            'txt3'=>'required|numeric|min:0|max:3',
            'txt4'=>'required|numeric|min:0|max:3',
            'txt5'=>'required|numeric|min:0|max:3',
            'txt6'=>'required|numeric|min:0|max:3',
            'txt7'=>'required|numeric|min:0|max:3',
            'txt8'=>'required|numeric|min:0|max:3',
            'txt9'=>'required|numeric|min:0|max:3',
            'txt10'=>'required|numeric|min:0|max:3',
            'txt11'=>'required|numeric|min:0|max:3',
            'txt12'=>'required|numeric|min:0|max:3',
            'txt13'=>'required|numeric|min:0|max:3',
            'txt14'=>'required|numeric|min:0|max:3',
        ];
    }

    public function messages()
    {
        return [
            'txt1.required'=>'اجابة السؤال الاول مطلوبه ',
            'txt2.required'=>'اجابة السؤال الثاني مطلوبه ',
            'txt3.required'=>'اجابة السؤال الثالث مطلوبه ',
            'txt4.required'=>'اجابة السؤال الرابع مطلوبه ',
            'txt5.required'=>'اجابة السؤال الخامس مطلوبه ',
            'txt6.required'=>'اجابة السؤال السادس مطلوبه ',
            'txt7.required'=>'اجابة السؤال السابع مطلوبه ',
            'txt8.required'=>'اجابة السؤال الثامن مطلوبه ',
            'txt9.required'=>'اجابة السؤال التاسع مطلوبه ',
            'txt10.required'=>'اجابة السؤال العاشر مطلوبه ',
            'txt11.required'=>'اجابة السؤال الحادي عشر مطلوبه ',
            'txt12.required'=>'اجابة السؤال الثاني عشر  مطلوبه ',
            'txt13.required'=>'اجابة السؤال الثالث عشر  مطلوبه ',
            'txt14.required'=>'اجابة السؤال الرابع عشر  مطلوبه ',

            'txt1.numeric'=>'اجابة السؤال الاول يجب ان تكون رقم من صفر الي ثلاثه  ',          
            'txt2.numeric'=>'اجابة السؤال الثاني يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt3.numeric'=>'اجابة السؤال الثالث يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt4.numeric'=>'اجابة السؤال الرابع يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt5.numeric'=>'اجابة السؤال الخامس يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt6.numeric'=>'اجابة السؤال السادس يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt7.numeric'=>'اجابة السؤال السابع يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt8.numeric'=>'اجابة السؤال الثامن  يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt9.numeric'=>'اجابة السؤال التاسع يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt10.numeric'=>'اجابة السؤال العاشر  يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt11.numeric'=>'اجابة السؤال الحادي عشر  يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt12.numeric'=>'اجابة السؤال الثاني عشر  يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt13.numeric'=>'اجابة السؤال الثالث عشر  يجب ان تكون رقم من صفر الي ثلاثه  ',
            'txt14.numeric'=>'اجابة السؤال الرابع عشر  يجب ان تكون رقم من صفر الي ثلاثه  ',

            'txt1.max'=>'إجابة السؤال الأول  لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt2.max'=>'إجابة السؤال الثاني  لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt3.max'=>'إجابة السؤال الثالث   لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt4.max'=>'إجابة السؤال الرابع  لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt5.max'=>'إجابة السؤال الخامس  لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt6.max'=>'إجابة السؤال السادس  لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt7.max'=>'إجابة السؤال السابع   لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt8.max'=>'إجابة السؤال الثامن   لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt9.max'=>'إجابة السؤال التاسع  لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt10.max'=>'إجابة السؤال العاشر   لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt11.max'=>'إجابة السؤال الحادي عشر   لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt12.max'=>'إجابة السؤال الثاني عشر   لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt13.max'=>'إجابة السؤال الثالث عشر   لا يجب أن تكون اكبر من ثلاثه   ' , 
            'txt14.max'=>'إجابة السؤال الرابع عشر   لا يجب أن تكون اكبر من ثلاثه   ' , 


            'txt1.min'=>'إجابة السؤال الأول  لا يجب أن تكون أقل  من صفر' , 
            'txt2.min'=>'إجابة السؤال الثاني   لا يجب أن تكون أقل  من صفر' , 
            'txt3.min'=>'إجابة السؤال الثالث   لا يجب أن تكون أقل  من صفر' , 
            'txt4.min'=>'إجابة السؤال الرابع  لا يجب أن تكون أقل  من صفر' ,
            'txt5.min'=>'إجابة السؤال الخامس   لا يجب أن تكون أقل  من صفر' , 
            'txt6.min'=>'إجابة السؤال السادس  لا يجب أن تكون أقل  من صفر' , 
            'txt7.min'=>'إجابة السؤال السابع  لا يجب أن تكون أقل  من صفر' ,
            'txt8.min'=>'إجابة السؤال الثامن  لا يجب أن تكون أقل  من صفر' , 
            'txt9.min'=>'إجابة السؤال التاسع  لا يجب أن تكون أقل  من صفر' , 
            'txt10.min'=>'إجابة السؤال العاشر  لا يجب أن تكون أقل  من صفر' , 
            'txt11.min'=>'إجابة السؤال الحادي عشر   لا يجب أن تكون أقل  من صفر' , 
            'txt12.min'=>'إجابة السؤال الثاني عشر   لا يجب أن تكون أقل  من صفر' , 
            'txt13.min'=>'إجابة السؤال الثالث عشر   لا يجب أن تكون أقل  من صفر ' , 
            'txt14.min'=>'إجابة السؤال الرابع عشر   لا يجب أن تكون أقل  من صفر' ,




        ];
    }
}
